content/imported/tutorials/volume-coupled-flow/fluid-openfoam/0/nut
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}

dimensions      [ 0 2 -1 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    outlet
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    upperWall
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    lowerWall
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    frontAndBack
    {
        type            empty;
    }
    defaultFaces
    {
        type            empty;
    }
}
