content/imported/tutorials/volume-coupled-flow/fluid-openfoam/0/p_rgh
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}

dimensions      [ 1 -1 -2 0 0 0 0 ];

internalField   uniform 103500;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            fixedValue;
        value           $internalField;
    }
    upperWall
    {
        type            zeroGradient;
    }
    lowerWall
    {
        type            zeroGradient;
    }
    frontAndBottom
    {
        type            empty;
    }
    defaultFaces
    {
        type            empty;
    }
}
